[
  {
    "name": "100,000 Steps",
    "class": "Barbarian",
    "type": "Boots",
    "secondary_stats": ["Evade Grants 10% Attack Speed for 3 Seconds"],
    "terciary_stats": [
      "Movement Speed",
      "Movement Speed per Walking Arsenal Bonus",
      "Damage to Stunned Enemies",
      "Ground Stomp Size"
    ],
    "effect": "When activating or refreshing the full Walking Arsenal Key Passive effect, you automatically cast Ground Stomp and gain [50-100] Fury. Can only occur once every 10 seconds.",
    "flavor": "\"While many Barbarians remained in the Dreadlands, small groups from the Oxen, Crane and Bear tribes instead chose to search the land for a new home.\" - A History of the Children of Bul-Kathos"
  },
  {
    "name": "Ahavarion, Spear of Lycander",
    "mythic": true,
    "type": "Staff",
    "secondary_stats": ["159.5% Critical Strike, Vulnerable, and Overpower Damage"],
    "terciary_stats": [
      "18% All Stats",
      "33% Movement Speed",
      "66% Resistance to All Elements",
      "Lucky Hit: Up to a 15% Chance to Restore 66% Primary Resource"
    ],
    "filters": ["Elite"],
    "effect": "Gain a random Shrine effect for 20 seconds after killing an Elite enemy. Can only occur once every 30 seconds.",
    "flavor": "\"The angel Lycander left us a portion of her power in this spear. It is all the proof I need that she watches over us still.\" - Oracle Argoysni"
  },
  {
    "name": "Airidah's Inexorable Will",
    "class": "Druid",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Lightning Resistance"],
    "terciary_stats": ["Willpower", "Damage to Close Enemies", "Lucky Hit Chance", "Ultimate Skill Cooldown Reduction"],
    "filters": ["Distant Enemies", "Pull"],
    "effect": "When casting an Ultimate Skill and again 5 seconds after, you Pull in Distant enemies and deal [X] Physical damage to them. This damage is increased by x2% per 1 point of Willpower you have.",
    "flavor": "\"When I was born, I breathed in the wind and the storm and they gave me life. When I die, I will breath out, and return that gift to the skies.\" - Journal excerpt"
  },
  {
    "name": "Ancients' Oath",
    "class": "Barbarian",
    "type": "2h Axe",
    "secondary_stats": ["Vulnerable Damage"],
    "terciary_stats": ["Damage to Close Enemies", "Cooldown Reduction", "Strength", "Ranks to Steel Grasp"],
    "filters": ["Pull"],
    "effect": "Steel Grasp launches 2 additional chains. Enemies hit by Steel Grasp take x [40-60%] increased damage from you for 5 seconds.",
    "flavor": "\"Weapons wielded by the fiercest warriors often catch the eye of the Ancient spirits. If the wielder is worthy, the spirits may bless the steel with their strength.\" - Gerti, Oxen Tribe Forgemaster"
  },
  {
    "name": "Andariel's Visage",
    "mythic": true,
    "type": "Helm",
    "secondary_stats": ["666% Poison Resistance"],
    "terciary_stats": ["30% Attack Speed", "77 All Stats", "86 Life On Hit", "10% Maximum Resistance"],
    "filters": ["Lucky Hit", "Poison"],
    "effect": "Lucky Hit: Up to a 20% chance to trigger a poison nova that applies [X] Poisoning damage over 5 seconds to enemies in the area.",
    "flavor": "The horrific whispers of the Maiden of Anguish flicker through your mind, pushing you ever closer to madness..."
  },
  {
    "name": "Arreat's Bearing",
    "class": "Barbarian",
    "type": "Pants",
    "terciary_stats": [
      "Ultimate Damage",
      "Call of the Ancients Cooldown Reduction",
      "Maximum Life",
      "Resistance to All Elements"
    ],
    "effect": "Ancients you summon are empowered.\nKorlic creates an Earthquake that deals [X] Physical damage over 4 seconds when he leaps.\nTalic leaves behind Dust Devils that deal [X] damage while he whirlwinds.\nMawdac ignites the ground Burning enemies for an additional [X] damage over 4 seconds when he upheaves the ground.",
    "flavor": "\"Rise clansmen and reclaim our trampled honor! Ancients' blood runs through us all! We are storms - earth breaking, maelstrom wielding. The fire of the gods burn still! They are with us!\" - Ealda"
  },
  {
    "name": "Asheara's Khanjar",
    "class": "Rogue",
    "type": "1h Dagger",
    "secondary_stats": ["Damage"],
    "terciary_stats": ["Critical Strike Chance", "Lucky Hit Chance", "Maximum Life", "Ranks to Weapon Mastery"],
    "filters": ["Attack Speed"],
    "effect": "Hits with this weapon increase your Attack Speed by [4-8%] for 4 seconds, up to [20-40%] .",
    "flavor": "When Caldeum's gates closed, Asheara led her Iron Wolves out of the city knowing full well they would never return. Instead they roamed Kehjistan pledging their blades to any who were in need."
  },
  {
    "name": "Axial Conduit",
    "class": "Sorcerer",
    "type": "Pants",
    "terciary_stats": [
      "Resource Generation",
      "Chance for Chain Lightning to Hit Twice",
      "Damage Reduction",
      "Ranks to Chain Lightning"
    ],
    "effect": "Chain Lightning alternates between orbiting you and seeking up to 3 enemies. When it returns, it drains 6 Mana from you for each active Chain Lightning. After draining 66 total Mana, the bolt explodes for [X] Lightning Damage. Chain Lightning expires if you don't have enough Mana for it to drain.",
    "flavor": "\"Do not confuse your manipulation of lightning as control. The azure flame is its own master and needs no hand to wield it. You are merely a conduit for its chaos.\" -Ascribed to the mage Woh"
  },
  {
    "name": "Azurewrath",
    "type": "1h Sword",
    "secondary_stats": ["Cold Damage"],
    "terciary_stats": [
      "Lucky Hit: Up to a 40% Chance to Deal [X] Cold Damage",
      "All Stats",
      "Attack Speed",
      "Cold Resistance"
    ],
    "filters": ["Lucky Hit", "Freeze", "Cold"],
    "effect": "Lucky Hit: Up to a 20% chance to Freeze enemies for 3 seconds and deal [X] Cold damage to them.",
    "flavor": "The ancient runeblade of the angel Izual, Azurewrath was miraculously spared the corruption that consumed its master."
  },
  {
    "name": "Band of First Breath",
    "class": "Spiritborn",
    "type": "Ring",
    "secondary_stats": ["Lightning Resistance", "Armor"],
    "terciary_stats": [
      "Damage for 4 Seconds After Gainiing Resolve",
      "Lucky Hit Chance while You Have a Barrier",
      "Maximum Life",
      "Ranks to Auspicious"
    ],
    "filters": ["Evade", "Resolve"],
    "effect": "Evading consumes 1 stack of Resolve to generate [20-40] Vigor.\n\nGain Armored Hide's Passive Effect.",
    "flavor": "A gentle whisper glides on the wind, words eluding mortal ken. It weaves through the soul like a melody forgotten, leaving naught but a name: Adarja, the First-Breather."
  },
  {
    "name": "Banished Lord's Talisman",
    "type": "Amulet",
    "secondary_stats": ["Resistance to All Elements"],
    "terciary_stats": ["Maximum Life", "Overpower Damage", "Attack Speed", "Ranks to Core Skills"],
    "filters": ["Overpower"],
    "effect": "After you spend 275 of your Primary Resource, your next Core Skill is guaranteed to Overpower. Your Critical Strikes that Overpower deal [20-60%] increased damage.",
    "flavor": "\"His name has been lost to history, but to have been exiled from a land as cursed as Hawezar, his deeds must have been truly depraved.\" - Scholar's Notes"
  },
  {
    "name": "Battle Trance",
    "class": "Barbarian",
    "type": "Amulet",
    "secondary_stats": ["Resistance to All Elements"],
    "terciary_stats": [
      "Critical Strike Chance",
      "Damage Reduction from Close Enemies",
      "Ranks to Duelist",
      "Ranks to Frenzy"
    ],
    "filters": ["Attack Speed"],
    "effect": "Increase Frenzy's maximum stacks by 2 . While at maximum stacks, you deal [15-30%] increased damage and your other Skills gain [35-55%] increased Attack Speed.",
    "flavor": "\"The change that overtook my brother in battle was terrifying. His eyes turned hard like diamonds, and the way he moved... it was like he was dancing to music only he could hear.\" - Captain Dervin"
  },
  {
    "name": "Beastfall Boots",
    "class": "Rogue",
    "type": "Boots",
    "secondary_stats": ["Maximum Evade Charges"],
    "terciary_stats": ["Ranks to Agile", "Maximum Resource", "Ultimate Cooldown Reduction", "Movement Speed"],
    "filters": ["Ultimate", "Core", "Energy"],
    "effect": "When you cast an Ultimate Skill, your next Core Skill consumes all of your energy and deals [0.25-0.75%] increased damage per Energy consumed. Using a Cooldown restores 25 Energy.",
    "flavor": "\"Genai grew proud and fond of boasting of her hunting prowess. She claimed she was fast enough to catch even the spirit Leraye, who cursed her for such an insult.\" - Fable of Genai's Twenty Trials"
  },
  {
    "name": "Black River",
    "class": "Necromancer",
    "type": "1h Scythe",
    "secondary_stats": ["Attack Speed"],
    "terciary_stats": [
      "Chance for Corpse Explosion to Deal Double Damage",
      "Ranks to Corpse Skills",
      "Ranks to Hewed Flesh",
      "Ranks to Fueled by Death"
    ],
    "effect": "Corpse Explosion consumes up to 4 additonal Corpses around the initial Corpse, gaining [120-160%] damage and [42-50%] Size per additional Corpse consumed.",
    "flavor": "\"The scrolls describe a river of tar that separated the living from the land of the dead. Any unfortunate soul who tried to cross would be dragged down into oblivion.\" - Notes of Scholar Kamien"
  },
  {
    "name": "Blood Artisan's Cuirass",
    "class": "Necromancer",
    "type": "Chest Armor",
    "terciary_stats": [
      "Blood Orbs Restore [X] Essence",
      "Damage for 4 Seconds After Picking up a Blood Orb",
      "Maximum Life",
      "Ranks to Bone Spirit"
    ],
    "filters": ["Blood Orb"],
    "effect": "When you pick up [10-3] Blood Orbs, a free Bone Spirit is spawned, dealing bonus damage based on your current Life percent.",
    "flavor": "\"The infamous Necromancer Gaza-Thul's mastery over blood magic was indisputable. Many suspect that upon his death, his skin was used to fashion this eldritch armor.\" - Barrett's Book of Implements"
  },
  {
    "name": "Blood Moon Breeches",
    "class": "Necromancer",
    "type": "Pants",
    "secondary_stats": ["While Injured, Your Potion Also Grants 30% Movement Speed for 2 Seconds"],
    "terciary_stats": ["Overpower Damage", "Curse Duration", "Maximum Life", "Ranks to Curse Skills"],
    "filters": ["Overpower"],
    "effect": "Your Minions' attacks have a [3-7%] to randomly inflict Decrepify or Iron Maiden. You deal [100-150%] increased Overpower damage to enemies affected by your Curses.",
    "flavor": "A naturally occurring curiosity, the blood moon persists as a sign of woe for the most superstitious Zakarum faithful. Children born under it are often considered cursed and cast out, lest it spread."
  },
  {
    "name": "Bloodless Scream",
    "class": "Necromancer",
    "type": "2h Scythe",
    "secondary_stats": ["Non-Physical Damage"],
    "terciary_stats": ["Lucky Hit Chance", "Intelligence", "Ranks to Darkness Skills", "Freeze Duration"],
    "filters": ["Lucky Hit", "Chill"],
    "effect": "Your Darkness Skills Chill enemies for up to 100% and deal [100-200%] increased damage to Frozen enemies.\n\nLucky Hit: Your Darkness Skills have up to a 100% chance to generate [15-25] additonal Essence against Frozen targets.",
    "flavor": "\"My companion swung her odd weapon in a wide arc, and our pursuer stopped short. The look of horror on his face as his body fell to pieces will haunt me forever.\" - The Ebon Pages, Canto II, Verse XI"
  },
  {
    "name": "Blue Rose",
    "class": "Sorcerer",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Cold Resistance"],
    "terciary_stats": [
      "Ice Spike Damage",
      "Cold Damage",
      "Critical Strike Chance",
      "Chance for Ice Spikes to Explode Twice"
    ],
    "filters": ["Frozen"],
    "effect": "Lucky Hit: Up to a 30% chance to form an exploding Ice Spike, dealing [X] Cold damage. Triple this chance if the enemy is Frozen.",
    "flavor": "\"Her lover's spirit faded and in her sorrow she wept frozen tears. Where they fell, roses of the purest ice would blossom each winter.\" - Greenslade's Tales, Chapter 7: \"The Myth of Irina Coldheart\""
  },
  {
    "name": "Condemnation",
    "class": "Rogue",
    "type": "1h Dagger",
    "secondary_stats": ["Damage"],
    "terciary_stats": [
      "Basic Attack Speed",
      "Lucky Hit: Up to a [X%] Chance to Make Enemies Vulnerable for 2 Seconds",
      "Damage per Combo Point Spent",
      "Dexterity"
    ],
    "effect": "Your Core Skills deal [20-40%] increased damage when spending 3 Combo Points. Your Skills using this weapon have a 50% chance to generate 3 Combo Points.",
    "flavor": "\"I've never seen such ruthless butchery. He deserves to be be shipped off to die in the swamps with the rest of the godless murderers.\" - Witness to the murder of Sergeant Walcot"
  },
  {
    "name": "Cowl of the Nameless",
    "class": "Rogue",
    "type": "Helm",
    "terciary_stats": [
      "Ranks to Unstable Elixirs",
      "Ranks to Trick Attacks",
      "Ranks to Rapid Gambits",
      "Crowd Control Duration"
    ],
    "filters": ["Lucky Hit", "Crowd Control"],
    "effect": "You gain [20-40%] increased Lucky Hit Chance against Crowd Controlled enemies.",
    "flavor": "\"He is banished from the Guild, his name stricken from the Book. His punishment is to never have been.\" - Excerpt from a burned parchment"
  },
  {
    "name": "Craze of the Dead God",
    "class": "Spiritborn",
    "type": "Gloves",
    "terciary_stats": [
      "Ranks to Antivenom",
      "Ranks to Nourishment",
      "Ranks to Touch of Death",
      "Critical Strike Chance"
    ],
    "effect": "When you would take direct damage, it is instead distributed as Poisoning over the next 10 seconds but increased by [30-0%] .\n\nLucky Hit: Direct damage has up to a 25% chance based on your Poisoned Life percentage to infect an enemy with Touch of Death.",
    "flavor": "T'an seized a spear and drove it thrice into his mad brother Tan. Alas, the craftier of the twin gods wove one last cunning snare. In place of blood, the wound wept venom and consumed all in its wake."
  },
  {
    "name": "Crown of Lucion",
    "type": "Helm",
    "terciary_stats": ["Maximum Life", "Cooldown Reduction", "Lucky Hit", "Shadow Resistance"],
    "filters": ["Resource Cost"],
    "effect": "Each time you use a Skill with a Resource Cost, gain x [5-15%] increased damage and Resource Cost is increased by +30% for 4 seconds, stacking up to 5 times.",
    "flavor": "The prince of Hatred, fair as maggots over carrion. He claims no throne, crafts no realms, reigning over only a blackened, bitter heart. Some legends name him banished, while others dread his return."
  },
  {
    "name": "Cruor's Embrace",
    "class": "Necromancer",
    "type": "Gloves",
    "terciary_stats": [
      "Maximum Life",
      "Ranks to Tides of Blood",
      "Blood Surge Drains + [X] Times from Elites",
      "Ranks to Blood Surge"
    ],
    "filters": ["Blood Surge", "Corpse"],
    "effect": "Casting Blood Surge consumes nearby Corpses to cause mini novas, dealing [X] damage. This damage is increased by x10% for each enemy drained by your initial cast, up to x50%, as well as by x20% for each Corpse consumed.",
    "flavor": "In the blood dancer's grasp, a victim lies, A vessel dried 'neath darkened skies. Their life extinguished, veins burst and drained, In Cruor's embrace, forever enchained."
  },
  {
    "name": "Deathless Visage",
    "class": "Necromancer",
    "type": "Helm",
    "terciary_stats": [
      "Ranks to Bone Spear",
      "Chance for Bone Spear Projectiles to Cast Twice",
      "Armor",
      "Maximum Resource"
    ],
    "effect": "Bone Spear leaves behind echoes as it travels that explode dealing [X] damage, increased by x5% for every 30% of your Critical Strike Damage Bonus.",
    "flavor": "\"Rathma is endless. He was the first Ancient, and will remain at the end. He is the master of the Great Cycle of Being. When Death comes for him, why should he fear it?\" - Vauntus, Acolyte of Rathma"
  },
  {
    "name": "Deathspeaker's Pendant",
    "class": "Necromancer",
    "type": "Amulet",
    "secondary_stats": ["Resistance to All Elements"],
    "terciary_stats": [
      "Ranks to Coalesced Blood",
      "Attack Speed",
      "Ranks to Blood Surge",
      "+1 Essence per Enemy Drained by Blood Surge"
    ],
    "effect": "Blood Surge casts a mini nova on your Minions, dealing [X] damage. Damage is increased by 10% per target drained by the initial cast, up to 50%.",
    "flavor": "Once a sanctum for Rathma's studies, the Temple of the Deathspeaker became a proving grounds for potential leaders of his priesthood. Its halls are filled with the corpses of those who failed."
  },
  {
    "name": "Dolmen Stone",
    "class": "Druid",
    "type": "Amulet",
    "secondary_stats": ["Resistance to All Elements"],
    "terciary_stats": [
      "Ranks to Wrath Skills",
      "Nature Magic Cooldown Reduction",
      "Ranks to Crushing Earth",
      "Movement Speed while Hurricane is Active"
    ],
    "effect": "Casting Boulder while Hurricane is active will cause your boulders to rotate around you instead. Boulder's damage is increased by [10-30%] for each one currently rotating. You may have up to 10 Boulders active at a time.",
    "flavor": "\"As the hateful mob beat on his door, he gripped the pulsing shard tightly and screamed for calm. When he opened his eyes, all that greeted him was silence and the blood-smeared ruins of his cottage.\""
  },
  {
    "name": "Doombringer",
    "mythic": true,
    "type": "1h Sword",
    "secondary_stats": ["100% Damage"],
    "terciary_stats": [
      "114 All Stats",
      "10% Damage Reduction",
      "Lucky Hit: Up to a 15% Chance to Heal for 530 Life",
      "35% Maximum Life"
    ],
    "filters": ["Lucky Hit", "Shadow"],
    "effect": "Lucky Hit: Up to a 25% chance to deal [X] Shadow damage to surrounding enemies and reduce their damage dealt by 20% for 5 seconds.",
    "flavor": "Whenever this ancient sword has reappeared throughout history, it portends a time of great strife, as well as a devastating loss of life."
  },
  {
    "name": "Eaglehorn",
    "class": "Rogue",
    "type": "Bow",
    "secondary_stats": ["Vulnerable Damage"],
    "terciary_stats": [
      "Chance for Penetrating Shot Projectiles to Cast Twice",
      "Ranks to Penetrating Shot",
      "Ranks to Malice",
      "Attack Speed"
    ],
    "filters": ["Vulnerable"],
    "effect": "Penetrating Shot makes enemies Vulnerable for 3 seconds.\nEvery 4th cast of Penetrating Shot bouces off walls and deals [50-150%] more damage.",
    "flavor": "\"Scholars have been unable to decipher the runes carved into this bow, however all agree they are related to its uncanny ability to bend arrows towards their targets.\" - Barrett's Book of Implements"
  },
  {
    "name": "Earthbreaker",
    "class": "Druid",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Cold Resistance"],
    "terciary_stats": [
      "Chance for Landslide Projectiles to Cast Twice",
      "Earth Attack Speed",
      "Ranks to Landslide",
      "Critical Strike Chance"
    ],
    "effect": "Casts of Landslide leave behind Tectonic Spikes that deal [X] Physical damage over 2 seconds. Spawning a Landslide pillar within Tectonic Spikes has a [20-30%] chance to spawn two instead.",
    "flavor": "When Arreat was sundered, the world quaked. The Druid Aglainn journeyed far to chronicle the aftermath. Grief-stricken by the great mountain king's fall, he rent the earth anew."
  },
  {
    "name": "Ebonpiercer",
    "class": "Necromancer",
    "type": "Amulet",
    "secondary_stats": ["Resistance to All Elements"],
    "terciary_stats": [
      "Ranks to Blight",
      "Ranks to Gloom",
      "Ranks to Reaper's Pursuit",
      "Chance for Blight Projectiles to Cast Twice"
    ],
    "effect": "Blight also shoots 4 smaller projectiles that pierce enemies and deal [X] Shadow damage over 3 seconds.",
    "flavor": "This talisman was the life's work of Deathspeaker Jurdann. Following his premature demise, Jurdann's successor wore the amulet in tribute as they trialed against the Temple of the Deathspeaker."
  },
  {
    "name": "Endurant Faith",
    "type": "Gloves",
    "terciary_stats": ["Maximum Life", "Lucky Hit Chance", "Healing Received", "All Stats"],
    "effect": "When you would be damaged for at least 40% of your Maximum Life at once, it is instead distributed over the next 2 seconds and reduced by x [10-30%] .",
    "flavor": "Despite the Light's blessings, countless Knights Penitent were hewn apart by the infernal hordes. Remnants of their steel lie scattered through the Hells – dwindling lights in the chaos."
  },
  {
    "name": "Esadora's Overflowing Cameo",
    "class": "Sorcerer",
    "type": "Amulet",
    "secondary_stats": ["Resistance to All Elements"],
    "terciary_stats": [
      "Intelligence",
      "Damage Reduction per Crackling Energy Charge",
      "Movement Speed for 4 Seconds After Picking Up Crackling Energy",
      "Crackling Energy Damage"
    ],
    "filters": ["Crackling Energy"],
    "effect": "Upon collecting Crackling Energy, there's a 15% chance to release a lightning nova, dealing [X] Lightning Damage, increased by 120% for every 100 Intelligence you have.",
    "flavor": "The only thing more potent than Esadora's magic was her endless hatred of humanity. As she lay dying, the pale amulet around her neck drank in both."
  },
  {
    "name": "Esu's Heirloom",
    "class": "Sorcerer",
    "type": "Boots",
    "secondary_stats": ["Evade Grants 125% Movement Speed for 3 Seconds"],
    "terciary_stats": [
      "Movement Speed",
      "Critical Strike Damage",
      "Movement Speed for 4 Seconds After Killing an Elite",
      "Resistance to All Elements"
    ],
    "filters": ["Movement Speed"],
    "effect": "Your Critical Strike Chance is increased by [20-40%] of your Movement Speed bonus.",
    "flavor": "\"While scholars have proven these boots were not created by Esu herself, it is noteworthy that they have been passed down since the formation of the Mage Clans.\" - Barrett's Book of Implements"
  },
  {
    "name": "Eyes in the Dark",
    "class": "Rogue",
    "type": "Pants",
    "secondary_stats": ["Traps Arm 1 Second Faster"],
    "terciary_stats": [
      "Ultimate Damage",
      "Ranks to Aftermath",
      "Maximum Life",
      "Damage Reduction from Enemies Affected by Trap Skills"
    ],
    "effect": "Death Trap deals [50-150%] increased damage and will re-arm iteself once after activating.",
    "flavor": "\"And so, when the sun dipped behind the hills each night, he knew that Ashen Jack would soon be near. Watching, and waiting.\" - Greenslade's Tales, Chapter 2: \"Each Long Night\""
  },
  {
    "name": "Fields of Crimson",
    "class": "Barbarian",
    "type": "2h Sword",
    "secondary_stats": ["Vulnerable Damage"],
    "terciary_stats": [
      "Damage to Bleeding Enemies",
      "Enhanced Rupture Explosion Size",
      "Strength",
      "Rupture Cooldown Reduction"
    ],
    "filters": ["Bleed"],
    "effect": "While using this weapon, damaging at least one enemy with Rupture creates a blood pool that inflicts [X] Bleeding damage over 6 seconds. Enemies standing in the pool take 30% increased damage.",
    "flavor": "\"We've been fighting these flesh-eaters for so long, been soaked in so much blood, that after a while it's difficult to tell what side you're truly on.\" - Daelyr, Crane Tribe warrior"
  },
  {
    "name": "Fists of Fate",
    "type": "Gloves",
    "terciary_stats": [
      "Lucky Hit Chance",
      "Critical Strike Chance",
      "Attack Speed",
      "Lucky Hit: Up to a [X%] Chance to Apply a Random Crowd Control Effect for 2 Seconds"
    ],
    "effect": "Your attacks randomly deal 1% to [200-300%] of their normal damage.",
    "flavor": "\"Will you let fear cheat you, or will you risk everything to find understanding? After all, death is simply the coin with which we purchase life.\" - Zurke"
  },
  {
    "name": "Flamescar",
    "class": "Sorcerer",
    "type": "Wand",
    "secondary_stats": ["Life On Hit", "Lucky Hit: Up to a 40% Chance to Deal 6,000 Fire Damage"],
    "terciary_stats": [
      "Intelligence",
      "Lucky Hit Chance",
      "[X%] Chance for Incinerate to Deal Double Damage",
      "Ranks to Incinerate"
    ],
    "filters": ["Fire"],
    "effect": "While Channeling Incinerate, you periodically shoot embers that are attracted to enemies, each dealing [X] Fire damage.",
    "flavor": "The burn may heal, but the pain is eternal."
  },
  {
    "name": "Flameweaver",
    "class": "Sorcerer",
    "type": "Gloves",
    "terciary_stats": [
      "Ranks to Pyromancy Skills",
      "Chance for Fire Bolt Projectiles to Cast Twice",
      "Attack Speed",
      "Firewall Size"
    ],
    "effect": "Casting Fire Bolt through your Firewall causes it to split into 3 bolts, each dealing [30-100%] more damage.",
    "flavor": "Driven to surpass Esu, the wizard Naridan's reckless enchantments caused an inferno, devastating the ancient town of Cagrim. Only the gauntlets remained - a solemn warning to all who dare tame fire."
  },
  {
    "name": "Fleshrender",
    "class": "Druid",
    "type": "1h Mace",
    "secondary_stats": ["Damage to Poisoned Enemies"],
    "terciary_stats": ["Willpower", "Ranks to Backlash", "Defensive Cooldown Reduction", "Ranks to Defensive Skills"],
    "filters": ["Poison"],
    "effect": "Casting a Defensive Skill deals [X] damage to Nearby Poisoned enemies, increased by x50% for every 100 Willpower you have.",
    "flavor": "\"This weapon is a reminder of the unbridled savagery of our druidic ancestors, the wisdom of which I see more clearly with every day that passes.\" - Moreg, Druidic Scholar"
  },
  {
    "name": "Flickerstep",
    "type": "Boots",
    "secondary_stats": [
      "Attacks Reduce Evade's Cooldown by 2.5 Seconds",
      "Evade Grants 30% Movement Speed for 1.5 Seconds"
    ],
    "terciary_stats": [
      "Movement Speed",
      "Lightning Resistance",
      "Damage Reduction from Close Enemies",
      "Ultimate Damage"
    ],
    "filters": ["Cooldown"],
    "effect": "Each enemy you Evade through reduces your active Ultimate Cooldown by [2.0-4.0] seconds, up to 10 seconds.",
    "flavor": "\"Considered a failure by their creator, it wasn't until the assassination of an \"untouchable\" Caldeum noble that these boots' true power was understood.\" - Barrett's Book of Implements"
  },
  {
    "name": "Fractured Winterglass",
    "class": "Sorcerer",
    "type": "Amulet",
    "secondary_stats": ["Conjuration Cooldowns are Reduced by [X] Seconds when a Frozen Orb Explodes"],
    "terciary_stats": [
      "Chance for Frozen Orb Projectiles to Cast Twice",
      "Non-Physical Damage",
      "Ranks to Conjuration Mastery",
      "Resistance to All Elements"
    ],
    "filters": ["Conjuration"],
    "effect": "Casting Frozen Orb has a [35-65%] chance to spawn a random Conjuration when it explodes.\n\nLucky Hit: Your Conjurations have up to a [50-90%] chance to launch a Frozen Orb at Nearby enemies.",
    "flavor": "Winterglass refracts light and also manipulates mana - forming complex arrays of spells and enchantments. These distinct characteristics posses great power, yet the outcomes remain unpredictable."
  },
  {
    "name": "Frostburn",
    "type": "Gloves",
    "secondary_stats": ["Lucky Hit Chance"],
    "terciary_stats": [
      "Lucky Hit: Up to a 40% Chance to Deal [X] Fire Damage",
      "Lucky Hit: Up to a 40% Chance to Deal [X] Cold Damage",
      "Fire and Cold Damage",
      "Attack Speed"
    ],
    "filters": ["Freeze", "Lucky Hit"],
    "effect": "Lucky Hit: Up to a [20-60%] chance to Freeze enemies for 3 seconds.",
    "flavor": "A touch so frigid it stops the heart and chills the very soul."
  },
  {
    "name": "Gloves of the Illuminator",
    "class": "Sorcerer",
    "type": "Gloves",
    "terciary_stats": [
      "Critical Strike Chance",
      "Fireball Attack Speed",
      "Mana when a Fireball Explodes",
      "Ranks to Fireball"
    ],
    "effect": "Fireball now bounces as it travels, exploding each time it hits the ground, but its explosion deals [70-100%] of normal damage.",
    "flavor": "After Inarius returned to Sanctuary, he sought a way back to the High Heavens. His first step was to reignite the religion he had abandoned millennia before: the Cathedral of Light."
  },
  {
    "name": "Godslayer Crown",
    "type": "Helm",
    "terciary_stats": ["Damage to Elites", "Cooldown Reduction", "Maximum Life", "All Stats"],
    "filters": ["Stun", "Freeze", "Immobilize", "Elite"],
    "effect": "When you Stun, Freeze, or Immobilize an Elite, you Pull In all Nearby enemies and deal [30-60%] increased damage to them for 3 seconds. Can only occur once every 12 seconds. Against Bosses, this effect triggers when dealing damage instead.",
    "flavor": "\"The Sahptev faithful believe in a thousand and one gods. If it takes me as many lifetimes, I will find and kill them all.\" - Gaspar Stilbian, Veradani Outcast"
  },
  {
    "name": "Gohr's Devastating Grips",
    "class": "Barbarian",
    "type": "Gloves",
    "terciary_stats": [
      "Critical Strike Chance Against Close Enemies",
      "Movement Speed",
      "Attack Speed",
      "Ranks to Whirlwind"
    ],
    "effect": "Whirlwind explodes every 2 seconds and after it ends, dealing [40-70%] of the base damage dealt to surrounding enemies as Fire damage.",
    "flavor": "\"The brutish construction of these gloves belies the strength they bestow. Gohr was clearly no craftsman, but it would be foolish to ignore the triumph of his work.\" - Barrett's Book of Implements"
  },
  {
    "name": "Grasp of Shadow",
    "class": "Rogue",
    "type": "Gloves",
    "terciary_stats": ["Attack Speed", "Lucky Hit Chance", "Ultimate Damage", "Ranks to Core Skills"],
    "filters": ["Lucky Hit"],
    "effect": "Lucky Hit: Damaging a Vulnerable enemy with a Marskman or Cutthroat Skill has up to a [24-44%] chance to summon a Shadow Clone that mimics that Skill.",
    "flavor": "Dark wisps creep hungrily across these gloves, like an assassin's blade seeking a life to steal on a moonless night."
  },
  {
    "name": "Greatstaff of the Crone",
    "class": "Druid",
    "type": "Staff",
    "secondary_stats": ["Damage to Close Enemies"],
    "terciary_stats": [
      "Damage to Close Enemies",
      "Storm Strikes Chains to 2 Targets",
      "Chance for Stormstrike to Hit Twice",
      "Ranks to Basic Skills"
    ],
    "effect": "Claw is now a Storm Skill and also casts Storm Strike at x [170-250%] normal damage.",
    "flavor": "\"She has existed in Scosglen since before Fiacla-Géar walked the land. Her purpose is a mystery to us all. However, approach her with deference; she may grant you her counsel.\" - Airidah, to Donan"
  },
  {
    "name": "Greaves of the Empty Tomb",
    "class": "Necromancer",
    "type": "Boots",
    "secondary_stats": ["Max Evade Charges", "Evade Leaves Behind Desecrated Ground for 2 Seconds"],
    "terciary_stats": [
      "Movement Speed",
      "Chance for Sever Projectiles to Cast Twice",
      "Sever Size",
      "Damage Reduction from Shadow Damage Over-Time Affected Enemies"
    ],
    "filters": ["Shadow"],
    "effect": "Sever leaves behind Desecrated Ground that deals [X] Shadow damage over 2 seconds.",
    "flavor": "\"The massive door to my family's crypt, which had taken a dozen men to close, was thrown open. Had I known the horrors to come I never would have set foot inside!\" -The Ebon Pages, Canto I, Verse VII"
  },
  {
    "name": "Harlequin Crest",
    "mythic": true,
    "type": "Helm",
    "terciary_stats": ["20% Cooldown Reduction", "365 Maximum Life", "18 Maximum Resource", "350 Armor"],
    "filters": ["Damage Reduction", "Skill Rank"],
    "effect": "Gain 20% Damage Reduction. In addition, gain +4 Ranks to all Skills.",
    "flavor": "\"This headdress was once worn by an assassin disguised as a court mage. Her treachery was unveiled, but not before she used its magic to curse the king's entire lineage.\" - The Fall of House Aston"
  },
  {
    "name": "Harmony of Ebewaka",
    "class": "Spiritborn",
    "type": "Helm",
    "terciary_stats": ["All Stats", "Movement Speed", "Damage Reduction", "Ranks to Velocity"],
    "effect": "According to your secondary Spirit Hall choice, your Skills are all additionally Jaguar, Eagle, Gorilla, or Centipede Skills.\r\n\r\nYour Skills deal x [10-30]% increased damage per Spirit type they have.",
    "flavor": "Only Ebewaka has walked amid a dozen Guardians. In death, they waged war for his spirit, yet none prevailed. Thus, the Guardians shared dominion, granting Ebewaka to roam freely amid all their realms."
  },
  {
    "name": "Hellhammer",
    "class": "Barbarian",
    "type": "2h Mace",
    "secondary_stats": ["Damage to Burning Enemies"],
    "terciary_stats": ["Upheaval Size", "Ranks to Upheaval", "Ranks to Wallop", "Strength"],
    "filters": ["Burn"],
    "effect": "Upheaval ignites the ground Burning enemies for an additonal [X] damage over 4 seconds increased by x25% for every 100 Strength you have.",
    "flavor": "The demon prince Ikonoth slew hundreds of the Heavenly Host with this infernal hammer before falling to none other than the Archangel Imperius himself."
  },
  {
    "name": "Heir of Perdition",
    "mythic": true,
    "type": "Helm",
    "secondary_stats": ["200% Damage to Angels and Demons"],
    "terciary_stats": ["20% Critical Strike Chance", "20% Lucky Hit Chance", "20% Movement Speed", "2 to Core Skills"],
    "effect": "Succumb to hatred and earn Mother’s Favor, increasing your damage dealt by x60%. Briefly steal Mother’s Favor from Nearby allies by slaughtering enemies.",
    "flavor": "Beware false prophets donned as sheep yet bearing the stench of wolves. Thou shalt know them by their fruits. For a tree of good cannot produce evil, nor thorns yield a harvest sweet and fair."
  },
  {
    "name": "Howl from Below",
    "class": "Necromancer",
    "type": "Gloves",
    "terciary_stats": [
      "Corpse Explosion Fears and Slows for [X] Seconds",
      "Ranks to Corpse Explosion",
      "Corpse Skill Attack Speed",
      "Lucky Hit Chance"
    ],
    "effect": "Instead of detonating immediately, Corpse Explosion summons a Volatile Skeleton that charges at a random enemy and explodes. Corpse Explosion's damage is increased by [30-50%] .",
    "flavor": "\"Can you not hear it? That endless scream from the cold earth beneath your feet!? They are down there, trapped, blind with rage! Waiting to drag us down into the sod!\" - Ravings of Madman Gustav"
  },
  {
    "name": "Hunter's Zenith",
    "class": "Druid",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Lightning Resistance"],
    "terciary_stats": ["Willpower", "Ranks to Predatory Instinct", "Ranks to Heightened Senses", "Ranks to Quickshift"],
    "filters": ["Heal"],
    "effect": "Every 30 seconds you spend in an animal form, your next Core Skill is guaranteed to Overpower and Critically Strike and deals x [30-60%] increased damage. Casting a Shapeshifting Skill reduces this timer by 1 second, or 2 seconds if you change to a new animal form.",
    "flavor": "\"By fang, claw, spear, or sword - send the bastards back to the flames from which they crawled! Soak the peat with their blood! For Fiacla-Géar! For Scosglen!\" - Nafain, during the Days of Ash"
  },
  {
    "name": "Iceheart Brais",
    "class": "Sorcerer",
    "type": "Pants",
    "secondary_stats": ["Your Potion Also Restores X% Resource"],
    "terciary_stats": ["Cold Resistance", "Maximum Life", "Frost Nova Size", "Shatter's Damage Echo"],
    "filters": ["Freeze"],
    "effect": "Enemies that die while Frozen, have a [21-40%] chance to unleash a Frost Nova.",
    "flavor": "The mad artisan saw his fingers turn black from frostbite as he worked the cloth, but refused to stay the needle and thread for even a moment."
  },
  {
    "name": "Insatiable Fury",
    "class": "Druid",
    "type": "Chest Armor",
    "terciary_stats": ["Maximum Life", "Ursine Strength's Bonuses", "Ranks to Iron Fur", "Werebear Overpower Damage"],
    "filters": ["Werebear"],
    "effect": "Werebear form is now your true form, and you gain [2-5] Ranks to all Werebear Skills.",
    "flavor": "When the Days of Ash began, the great druid Nafain reminded his disciples that nothing, not even the loss of their humanity, was too great a sacrifice to protect Túr Dúlra from Astaroth's flames."
  },
  {
    "name": "Jacinth Shell",
    "class": "Spiritborn",
    "type": "Chest Armor",
    "terciary_stats": ["Damage Reduction while Injured", "Maximum Life", "Life On Hit", "Ranks to Endurance"],
    "effect": "Spending Vigor Heals you for [1-10%] of your Maximum Life.\n\nEvery second, your active Cooldowns now drain 10% of your Maximum Life to reduce their durations by 3 seconds.",
    "flavor": "This ceremonial armor was once adorned during the He Sutsar Puchē, where sacred blood is drawn by jacinth lancets and offered to flames. It retains the scents of incensed smoke and scorched copper."
  },
  {
    "name": "Lidless Wall",
    "class": "Necromancer",
    "type": "Shield",
    "main_stat": "Total Armor",
    "secondary_stats": ["Blocked Damage Reduction", "Block Chance", "Main Hand Weapon Damage", "Total Armor"],
    "terciary_stats": [
      "Bone Storm Duration",
      "Chance for Bone Storm to Deal Double Damage",
      "Ranks to Bone Skills",
      "Cooldown Reduction"
    ],
    "filters": ["Lucky Hit", "Bone"],
    "effect": "Lucky Hit: While you have an active Bone Storm, hitting an enemy outside of a Bone Storm has up to a [15-45%] chance to spawn an additional Bone Storm at their location. Each of your active Sacrifice bonuses increases the chance by 25% and the total number of additional Bone Storms you can have by 1.",
    "flavor": "Initially an unpopular choice to replace Mendeln as Deathspeaker, Daros quickly proved his worth with the creation of this masterpiece."
  },
  {
    "name": "Locran's Talisman",
    "type": "Amulet",
    "secondary_stats": ["Resistance to All Elements"],
    "terciary_stats": ["Resistance to All Elements", "All Stats", "Critical Strike Damage", "Maximum Resource"],
    "filters": ["Critical Strike Chance", "Critical Strike Damage", "Primary Resource"],
    "effect": "Your skills gain + [0.10-0.40%] Critical Strike Chance bonus per point of Primary Resource you have, up to + [10-40%] . Each point of Primary Resource above 100 grants x0.2% Critical Strike Damage instead.",
    "flavor": "A single petal of the Mother's own blood, slowly wilting under glass."
  },
  {
    "name": "Loyalty's Mantle",
    "class": "Spiritborn",
    "type": "Helm",
    "terciary_stats": ["All Stats", "Movement Speed", "Damage Reduction", "Ranks to Velocity"],
    "effect": "While your Spirit Hall choices match: \nTheir bonuses are 100% more potent.\n Skills of their Base Spirit gain [20-60%] Vigor Cost Reduction.\n Skills of their Base Spirit gain [20-60%] Cooldown Reduction.",
    "flavor": "During a Trial of Mists, a small spirit noticed an unclaimed boy. In pity, it spared him. \"I will follow you always,\" vowed the boy. He remained true even after Ah Bulan called the spirit home."
  },
  {
    "name": "Mad Wolf's Glee",
    "class": "Druid",
    "type": "Chest Armor",
    "terciary_stats": [
      "Maximum Life",
      "Lupine Ferocity's Damage Bonus",
      "Werewolf Attack Speed",
      "Ranks to Digitigrade Gait"
    ],
    "filters": ["Werewolf"],
    "effect": "Werewolf form is now your true form, and you gain [4-7] Ranks to all Werewolf Skills.",
    "flavor": "\"He was not a victim of the curse - he sought it out. As his skin split and his bones cracked, his laughter never ceased.\" - Tale of the Mad Nobleman"
  },
  {
    "name": "Melted Heart of Selig",
    "mythic": true,
    "type": "Amulet",
    "secondary_stats": ["3% Maximum Resistance to All Elements", "30% Resistance to All Elements"],
    "terciary_stats": [
      "15% Damage Reduction while Healthy",
      "15% Lucky Hit Chance",
      "25% Movement Speed",
      "15% Resource Reduction"
    ],
    "effect": "Gain 60 maximum Resource. When taking damage, 75% is drained as 2 Resource for every 1% of Maximum Life you would have lost.",
    "flavor": "\"Do not allow your passions to become obsessions. Fuel the fire that burns within you, but it is madness to allow yourself to become ash to please an uncaring universe.\" - Last words of Master Selig"
  },
  {
    "name": "Mjölnic Ryng",
    "class": "Druid",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Shadow Resistance"],
    "terciary_stats": [
      "Ranks to Endless Tempest",
      "Willpower",
      "Movement Speed while Cataclysm is Active",
      "Critical Strike Chance"
    ],
    "effect": "While Cataclysm is active, you gain unlimited Spirit and deal x [40-100%] increased damage.",
    "flavor": "A singed wedding band, faintly crackling. It evokes an old rhyme where a bride receives a ring from her beloved, causing them to be struck thrice by lightning. Only the bride was unscathed."
  },
  {
    "name": "Mother's Embrace",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Shadow Resistance"],
    "terciary_stats": ["Attack Speed", "Critical Strike Chance", "Lucky Hit Chance", "All Stats"],
    "effect": "If a Core Skill hits 4 or more enemies, [30-60%] of the Resource is refunded.",
    "flavor": "\"Every tome, every scroll, every book in this temple produces the same answer. The only being willing to stand against the Eternal Conflict, against the Prime Evils, was Lilith.\" - Elias"
  },
  {
    "name": "Mutilator Plate",
    "class": "Necromancer",
    "type": "Chest Armor",
    "terciary_stats": [
      "Damage Reduction from Enemies Affected by Blood Skills",
      "Maximum Life",
      "Ranks to Blood Lance",
      "Chance for Blood Lance to Deal Double Damage"
    ],
    "effect": "You are Blood Lanced, and when Blood Lance would deal damage to you it instead Fortifies you for [1-4%] of your Maximum Life and has a 10% chance to form a Blood Orb. Blood Lance deals [10-40%] increased damage.",
    "flavor": "\"The Cathedral of Light's earliest attempts at crafting their penitent armor was to infuse the plate with painful blood magic, before such acts were deemed heretical.\" - Barrett's Book of Implements"
  },
  {
    "name": "Nesekem, The Herald",
    "class": "Spiritborn",
    "mythic": true,
    "type": "Glaive",
    "secondary_stats": ["223% Damage to Elites"],
    "terciary_stats": ["200 All Stats", "464 Maximum Life", "250% Critical Strike Damage", "450% Overpower Damage"],
    "filters": ["Critical Strike", "Vulnerable", "Overpower"],
    "effect": "Every 5 seconds, you randomly mark a Nearby enemy. Marked enemies are Vulnerable, and your attacks against them are guaranteed to Critically Strike and Overpower.\n\nHitting a marked enemy 10 times clears the mark from them.",
    "flavor": "In the days when Ajaw Y'ishich ruled Nahantu, the phoenix constellation's crown fell in burning glory. From it was forged a blade that withered valor, heralding an age of despair."
  },
  {
    "name": "Overkill",
    "class": "Barbarian",
    "type": "2h Mace",
    "secondary_stats": ["Damage to Injured Enemies"],
    "terciary_stats": ["Strength", "Physical Damage", "Vulnerable Damage", "Ranks to Death Blow"],
    "effect": "Death Blow creates a shockwave, dealing [40-60%] of its Base damage to enemies. Enemies who die to this effect also reset Death Blow's Cooldown.",
    "flavor": "The malformed snake creatures that live in the swamps are not content with simply killing their prey. They seem to take a malicious pleasure from inflicting as much suffering as possible before death."
  },
  {
    "name": "Paingorger's Gauntlets",
    "type": "Gloves",
    "terciary_stats": [
      "Attack Speed",
      "Ranks to Basic Skills",
      "Cooldown Reduction",
      "Lucky Hit: Up to a [X%] Chance to Stun for 2 Seconds"
    ],
    "effect": "Damaging enemies with a cast Non-Basic Skill marks them for 3 seconds. When a Basic Skill first hits a marked enemy, the Basic Skill's damage is echoed to all marked enemies, dealing [100-200%] increased damage.",
    "flavor": "Crafted from fragments of Duriel's carapace, wearing these gloves, or being struck by them, causes an agonizing sensation akin to pushing one's hands through a thousand shards of glass."
  },
  {
    "name": "Path of Trag'Oul",
    "class": "Necromancer",
    "type": "Boots",
    "secondary_stats": ["Maximum Evade Charges"],
    "terciary_stats": ["Movement Speed", "Ranks to Bone Skills", "Armor", "Bone Prison Cooldown Reduction"],
    "effect": "Bone Prison traps a larger area and fires [10-30] Bone Splinters at enemies trapped within. Increase your Maximum Essence by 2 for 10 seconds each time these Bone Splinters hit an enemy.",
    "flavor": "\"Essence flows endlessly, shifting between vessels. It is through Trag'Oul, keeper of all known and unknown, that we serve as custodians, directing essence to travel new paths.\" -Mendeln ul-Diomed"
  },
  {
    "name": "Peacemonger's Signet",
    "class": "Spiritborn",
    "type": "Ring",
    "secondary_stats": ["Fire  Resistance", "Armor"],
    "terciary_stats": [
      "Dodge Chance",
      "All Stats per Ferocity or Resolve Stack",
      "Ranks to Perseverance",
      "Ranks to Fueled"
    ],
    "filters": ["Vigor", "Ferocity", "Resolve"],
    "effect": "While you have at least 4 stacks of Ferocity, you gain [1-7] Vigor per second.\n\nGaining Ferocity also grants Resolve.",
    "flavor": "\"In Natsalarwaka, no blood shall mar the earth. Even bitter enemies must forgo their blades before entering the haven. Breaking this accord will invoke Wasipotsu's wrath.\" - Oral Umbuntu Scripture"
  },
  {
    "name": "Penitent Greaves",
    "type": "Boots",
    "secondary_stats": ["Evade Grants 125% Movement Speed for 2 Seconds", "Evade Grants Unhindered for 2 Seconds"],
    "terciary_stats": [
      "Movement Speed",
      "Chill Slow Potency",
      "Critical Strike Chance Against Chilled Enemies",
      "Cold Resistance"
    ],
    "filters": ["Chill"],
    "effect": "You leave behind a trail of frost that Chills enemies. You deal [12-25%] more damage to Chilled enemies.",
    "flavor": "Remorseful devotees of the Cathedral of Light must undertake a grueling pilgrimage, journeying across the frigid glacier known as the Serac Rapture. Only then may their gravest sins be forgiven."
  },
  {
    "name": "Pitfighter's Gull",
    "class": "Rogue",
    "type": "Ring",
    "secondary_stats": ["Shadow Resistance", "Resistance to All Elements"],
    "terciary_stats": [
      "Damage on Next Attack After Entering Stealth",
      "Critical Strike Chance",
      "Smoke Grenade Cooldown Reduction",
      "Ranks to Mending Obscurity"
    ],
    "filters": ["Stealth", "Critical Strike", "Grenade"],
    "effect": "Casting Smoke Grenade increases your Critical Strike Damage by x33% for [3-6] seconds and leaves behind a cloud of shadows. While within the cloud, you gain Stealth once per second."
  },
  {
    "name": "Protection of the Prime",
    "class": "Spiritborn",
    "type": "Pants",
    "terciary_stats": [
      "Maximum Life",
      "Damage for 4 Seconds After Dodging an Attack",
      "Damage Reduction while Standing Still",
      "Ranks to Defensive Skills"
    ],
    "filters": ["Dodge", "Unstoppable"],
    "effect": "While moving you gain [10-30%] Dodge Chance. After standing still for 2 seconds you become Unstoppable until you move.",
    "flavor": "\"To commune with spirits, listen to whispers unseen. Root yourself to the earth and let its pulse still the mind. Hear the ancient guardians. They rise to aid you.\" – Ysevete, the First Spiritborn"
  },
  {
    "name": "Rage of Harrogath",
    "class": "Barbarian",
    "type": "Chest Armor",
    "terciary_stats": [
      "Maximum Life",
      "Damage Reduction from Bleeding Enemies",
      "Critical Strike Chance",
      "Damage Over Time"
    ],
    "filters": ["Lucky Hit", "Bleed"],
    "effect": "Lucky Hit: Inflicting Bleeding on an enemy has up to a [20-60%] chance to reduce the Cooldowns of your Skills by 1 second.",
    "flavor": "Harrogath, the final bastion of resistance against Baal's assault on Mt. Arreat was destroyed along with the Worldstone. The survivors never forgave the betrayal that led to the loss of their home."
  },
  {
    "name": "Raiment of the Infinite",
    "class": "Sorcerer",
    "type": "Chest Armor",
    "terciary_stats": [
      "Intelligence",
      "Ranks to Elemental Attunement",
      "Ranks to Shocking Impact",
      "Ranks to Glass Cannon"
    ],
    "filters": ["Pull", "Stun"],
    "effect": "After using Teleport, Close enemies are Pulled to you and Stunned for [2-3] seconds, but Teleport's cooldown is increased by 20%.",
    "flavor": "The power you have is never enough."
  },
  {
    "name": "Rakanoth's Wake",
    "type": "Boots",
    "secondary_stats": ["Attacks Reduce Evade's Cooldown by 1.5 Seconds"],
    "terciary_stats": ["Movement Speed", "Cooldown Reduction", "Resistance to All Elements", "Non-Physical Damage"],
    "effect": "When you cast a Skill with a Cooldown, you explode, dealing [X] Fire damage.",
    "flavor": "Tread carefully on the plains of Hell, for each step sunders the soul and shatters the mind."
  },
  {
    "name": "Ramaladni's Magnum Opus",
    "class": "Barbarian",
    "type": "1h Sword",
    "secondary_stats": ["Damage"],
    "terciary_stats": ["Critical Strike Damage", "Strength", "Maximum Resource", "Overpower Damage"],
    "effect": "Skills using this weapon deal [0.2-0.5%] increased damage per point of Fury you have, but you lose 10 Fury every second.",
    "flavor": "\"Without him the wine is less sweet, the hearth less warm, and our blades less keen. Our blood brother is gone, but Bul-Kathos willing, we will meet again one day.\" - Sorrowsong for Ramaladni"
  },
  {
    "name": "Razorplate",
    "type": "Chest Armor",
    "terciary_stats": ["Thorns", "Thorns", "Thorns", "Thorns"],
    "filters": ["Thorns"],
    "effect": "Thorns has a 10% chance to deal [100-200%] increased damage.",
    "flavor": "Crafted by the cannibal Armoda, each piece of this interlocking armor has been sharpened into a knife's edge. Even a century after death, the plate remained on her corpse, unable to be removed safely."
  },
  {
    "name": "Ring of the Midday Hunt",
    "class": "Spiritborn",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Resistance to All Elements"],
    "terciary_stats": [
      "Movement Speed for 2 Seconds After Killing an Enemy",
      "Life On Kill",
      "Attack Speed",
      "Ranks to Nourishment"
    ],
    "filters": ["Vigor", "Ferocity", "Poison"],
    "effect": "Your Maximum Vigor is increased by 50% and every kill grants you [1-7] Vigor.\nWhile you have any Ferocity, your Poisoning effects deal their damage across 33% of the normal duration.",
    "flavor": "At midday thundered the first brother, Nyamoyo, lord of predators. Survival is his blessing, hunting is his prayer. Honor him and prowess shall be your reward.\" - The Nitī Sē, Verse IV"
  },
  {
    "name": "Ring of the Midnight Sun",
    "class": "Spiritborn",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Resistance to All Elements"],
    "terciary_stats": ["Dexterity", "Cooldown Reduction", "Critical Strike Damage", "Ranks to Mirage"],
    "filters": ["Critical Strike", "Critical Strike Damage"],
    "effect": "When you Critically Strike, you regain [20-50%] of the Vigor you've spent in the last 2 seconds.\r\n\r\nGain Counterattack's Passive Effect.",
    "flavor": "\"At midnight laughed the second brother, Nebahayomo, spirit of cunning. Trickery is his blessing, suffering is his prayer. Honor him and shrewdness shall be your reward.\" - The Nitī Sē, Verse V"
  },
  {
    "name": "Wound Drinker",
    "class": "Spiritborn",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Resistance to All Elements"],
    "terciary_stats": [
      "Thorns",
      "Damage Reduction from Poisoned Enemies",
      "Damage to Poisoned Enemies",
      "Ranks to Toxic Skin"
    ],
    "filters": ["Thorns"],
    "effect": "Every time you deal Thorns damage, you gain [1-7] Vigor.\n\nGain Toxic Skin's Passive Effect.",
    "flavor": "The inner curve of this band is lined with thorns that tear the skin whenever it is unbound."
  },
  {
    "name": "Ring of Mendeln",
    "class": "Necromancer",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Shadow Resistance"],
    "terciary_stats": [
      "Minion Attack Speed",
      "Ranks to Skeletal Warrior Mastery, Skeletal Mage Mastery, and Golem Mastery",
      "Damage",
      "Intelligence"
    ],
    "effect": "Every 6th attack from each Minion is empowered, exploding for [X] Physical damage.",
    "flavor": "The signet of Mendeln ul-Diomed, the founder of the Priests of Rathma and the first Necromancer, was lost for over 3,000 years. The immense power over death held within, however, has not diminished."
  },
  {
    "name": "Ring of Red Furor",
    "class": "Barbarian",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Fire Resistance"],
    "terciary_stats": ["Maximum Resource", "Attack Speed", "Critical Strike Damage", "Fire Resistance"],
    "filters": ["Critical Strike"],
    "effect": "After spending 100 Fury within 3 seconds, your next cast of Hammer of the Ancients, Upheaval, or Death Blow within 5 seconds is a guaranteed Critical Strike and deals [30-60%] bonus Critical Strike Damage.",
    "flavor": "\"Anger brings strength but clouds the mind. You must learn to focus your fury, direct it with purpose. Keep our sacred duty at the forefront of your mind, always.\" -Talic, to Madawc"
  },
  {
    "name": "Ring of Starless Skies",
    "mythic": true,
    "type": "Ring",
    "secondary_stats": ["12.5% Resistance to All Elements", "12.5% Resistance to All Elements"],
    "terciary_stats": [
      "17.5% Attack Speed",
      "12.5% Critical Strike Chance",
      "12.5% Lucky Hit Chance",
      "+2 to Core Skills"
    ],
    "effect": "Spending your Primary Resource reduces the Resource cost of your Skills and increases your damage by x10% for 3 seconds, up to x50%.",
    "flavor": "\"Yours is the power to pluck the stars from the heavens with the ease of a child gathering fruit from the bough.\" - Unknown"
  },
  {
    "name": "Ring of the Ravenous",
    "class": "Barbarian",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Shadow Resistance"],
    "terciary_stats": ["Critical Strike Chance", "Vulnerable Damage", "Ranks to Brawling Skills", "Ranks to Rend"],
    "effect": "Rend's duration is increased by [4-8] seconds. Damaging enemies with Brawling Skills applies 2 stacks of Rend's Bleed. This can only affect each enemy once every 1 second.",
    "flavor": "\"The hunger, it starts so small, like a tickle in the back of your mind. You believe the lie that you still have control until you're so far gone you can't even recognize yourself.\" - Varyana"
  },
  {
    "name": "Ring of the Sacrilegious Soul",
    "class": "Necromancer",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Poison Resistance"],
    "terciary_stats": ["Ranks to Grim Harvest", "Ranks to Corpse Skills", "Lucky Hit Chance", "Movement Speed"],
    "effect": "You automatically activate the following equipped Skills on Corpses around you:\nRaise Skeleton every [2-1] seconds.\nCorpse Explosion every [2-1] seconds.\nCorpse Tendrils every [12-6] seconds.",
    "flavor": "The mere proximity of a practitioner of such dark arts can rouse the dead and disturb those souls who have earned their rest."
  },
  {
    "name": "Rod of Kepeleke",
    "class": "Spiritborn",
    "type": "Quarterstaff",
    "secondary_stats": ["Block Chance"],
    "terciary_stats": [
      "Critical Strike Damage",
      "Maximum Resource",
      "Ranks to Velocity",
      "Chance for Core Skills to Hit Twice"
    ],
    "filters": ["Core", "Basic", "Critical Strike Damage"],
    "effect": "Your Core Skills are now additionally Basic Skills, free to cast, and deal up to 30% less damage based on their Vigor Cost.\n\nWhen cast at Maximum Vigor, your Core Skills consume all Vigor to return to full damage, cast at their largest Size, and become guaranteed Critical Strikes, with x [1-3%] increased Critical Strike Damage for each point of Vigor spent this way.",
    "flavor": "\"Beyond the world disc doth lie the keeper serpent Kepeleke. Ceaseless the serpent grows, and thus must ever consume his own tail, lest the world be overtaken.\" - Lintel XII"
  },
  {
    "name": "Ring of Writhing Moon",
    "class": "Spiritborn",
    "type": "Ring",
    "secondary_stats": ["Lightning Resistance", "Poison Resistance"],
    "terciary_stats": [
      "Critical Strike Chance",
      "Movement Speed",
      "Lucky Hit: Up to a [X%] Chance to Make Enemies Vulnerable for 2 Seconds",
      "Ranks to Unrestrained"
    ],
    "filters": ["Poison", "Vigor"],
    "effect": "A Pestilent Swarm spawns from you every 10 seconds, dealing [X] Poison damage per hit.\r\n\r\nYour Pestilent Swarms now orbit around you and generate 1 Vigor per hit.",
    "flavor": "\"Within this corpse-bound carapace we writhe. Chaotic winds converge to churn your bones. Our beat and breath a ceaseless war to break. The wretched cyclone black beyond the bounds.\" - Balazan's Dream"
  },
  {
    "name": "Saboteur's Signet",
    "class": "Rogue",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Shadow Resistance"],
    "terciary_stats": [
      "Grenade Damage",
      "Stun Grenade Size",
      "Energy when a Stun Grenade Explodes",
      "Cooldown Reduction"
    ],
    "filters": ["Stun"],
    "effect": "Casting a Core Skill has a [15-45%] chance to throw Stun Grenades that deal [X] Physical damage and Stun enemies for 1 second. Your Stun Grenades gain 5% Lucky Hit Chance.",
    "flavor": "\"The element of surprise is the starting point. In this moment, be sure to finish it.\" - Kashya"
  },
  {
    "name": "Scoundrel's Kiss",
    "class": "Rogue",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Poison Resistance"],
    "terciary_stats": [
      "Critical Strike Chance to each Enhanced Rapid Fire Bonus",
      "Ranks to Rapid Fire",
      "Chance for Rapid Fire Projectiles to Cast Twice",
      "Attack Speed"
    ],
    "effect": "Rapid Fire now lobs exploding arrows that deal [15-35%] increased damage.",
    "flavor": "\"This'll blow your hair back.\" - Lyndon"
  },
  {
    "name": "Scoundrel's Leathers",
    "class": "Rogue",
    "type": "Chest Armor",
    "terciary_stats": [
      "Inner Sight Duration",
      "Movement Speed while the Inner Sight Gauge is Full",
      "Damage Reduction from Enemies Affected by Trap Skills",
      "Maximum Life"
    ],
    "effect": "While you have unlimited Energy from Inner Sight, your Core Skills have a [60-80%] chance to spawn Caltrops, Poison Trap, or Death Trap.",
    "flavor": "\"Rumor has it he lost them in a game of Skull & Anchor, but the boss is a devil with the dice. I think he wanted to give the poor sod something to keep him warm without wounding his pride.\" - Elstir"
  },
  {
    "name": "Sepazontec",
    "class": "Spiritborn",
    "type": "Quarterstaff",
    "secondary_stats": ["Block Chance"],
    "terciary_stats": [
      "Chance for Basic Skills to Deal Double Damage",
      "Ranks to Follow Through",
      "Dexterity",
      "Basic Skill Lucky Hit Chance"
    ],
    "filters": ["Basic"],
    "effect": "Your Basic Skills deal [25-50%] increased damage and always use their 3rd attack.\nEvery 3rd cast of a Basic Skill strikes three times.",
    "flavor": "To the silent heavens, the hunter Etzlek raised his staff and smote the numen. \"Release her!\" came his cries as desecrated the hallowed ground. On the third strike, the spirit answered..."
  },
  {
    "name": "Shard of Verathiel",
    "type": "1h Sword",
    "secondary_stats": ["Damage"],
    "terciary_stats": ["All Stats", "Ranks to Basic Skills", "Basic Attack Speed", "Maximum Resource"],
    "filters": ["Basic"],
    "effect": "Basic Skills deal x [50-200%] increased damage but additionally cost 25 Primary Resource.",
    "flavor": "This blade once bore divine purpose wielded by the angel Verathiel. Like its keeper, the sword fell to Infernal depths. Yet beneath this corruption, is a heartbeat of a past memory, holding steadfast."
  },
  {
    "name": "Shattered Vow",
    "mythic": true,
    "icon": true,
    "type": "Polearm",
    "secondary_stats": ["400% Damage to Healthy Enemies"],
    "terciary_stats": [
      "Lucky Hit: Up to a +44.4% Chance to Become Berserking",
      "29.6% Attack Speed while Berserking",
      "444.4% Damage Over Time",
      "444 Maximum Life"
    ],
    "effect": "Enemies afflicted by more Damage over Time than remaining Life are Executed."
  },
  {
    "name": "Shroud of False Death",
    "mythic": true,
    "type": "Chest Armor",
    "secondary_stats": ["1 to All Passives"],
    "terciary_stats": [
      "111 All Stats",
      "333% Damage on Next Attack After Entering Stealth",
      "222 Maximum Life",
      "11.1% Resource Generation"
    ],
    "filters": ["Stealth", "Movement Speed"],
    "effect": "If you haven't dealt damage in the last 2 seconds, gain Stealth and +40% Movement Speed.",
    "flavor": "Beware false prophets donned as sheep yet bearing the stench of wolves. Thou shalt know them by their fruits. For a tree of good cannot produce evil, nor thorns yield a harvest sweet and fair."
  },
  {
    "name": "Shroud of Khanduras",
    "class": "Rogue",
    "type": "Chest Armor",
    "terciary_stats": [
      "Evade Grants Movement Speed for 1.5 Seconds",
      "Non-Physical Damage",
      "Ranks to Dark Shroud",
      "Shadow Resistance"
    ],
    "filters": ["Immune"],
    "effect": "Casting Dark Shroud makes you Immune for 2 seconds but your Evade Cooldown is increased by [9-3] seconds. Evading while Dark Shroud is active leaves behind an explosion that deals [X] Shadow Damage and Pulls In enemies.",
    "flavor": "\"Auriel alone saw past Lucion's guise. With Al'maiesh aloft, she smote the vile prince. Hatred's seed feigned death and waited, loath to enter the Abyss again.\" - The Great\r\nConflict, Tome I"
  },
  {
    "name": "Sidhe Bindings",
    "class": "Sorcerer",
    "icon": true,
    "type": "Gloves",
    "terciary_stats": [
      "Non-Physical Damage",
      "Chance for Familiar to Hit Twice",
      "Familiar Explosion Size",
      "Ranks to Familiar"
    ],
    "filters": ["Cooldown"],
    "effect": "Casting Familiar now summons all three elemental variants at once. Familiar's duration is increased by x [25-50%] and its Cooldown is reduced by 2 seconds, but its maximum Charges are reduced by 1.",
    "flavor": "\"While known for their proclivity for mischief, the Sidhe, as the Druids call them, are fiercely loyal and will defend all they consider friend...\" - Sarnakyle"
  },
  {
    "name": "Skyhunter",
    "class": "Rogue",
    "type": "Bow",
    "secondary_stats": ["Critical Strike Damage"],
    "terciary_stats": [
      "Chance for Marksman Projectiles to Cast Twice",
      "Critical Strike Damage",
      "Ranks to Stutter Step",
      "Attack Speed"
    ],
    "filters": ["Critical Strike"],
    "effect": "The first direct damage you deal to an enemy is a guaranteed Critical Strike. When you consume Precision casting a Skill, that Skill gains x [20-60%] increased Critical Strike Damage and you gain [30-60] Energy.",
    "flavor": "\"Genai took up her bow and aimed at the sun itself. The light burned her eyes, but her arrow flew true. Wounded, the sun hid, and brought forth the first night. - Fable of the Great Sky-Hunt"
  },
  {
    "name": "Scorn of the Earth",
    "class": "Spiritborn",
    "type": "Boots",
    "secondary_stats": ["Maximum Evade Charges"],
    "terciary_stats": [
      "Movement Speed",
      "Ranks to Soar",
      "Soar Deals up to [X%] Damage Based on Distance Traveled",
      "Soar Grants [X%] Maximum Life as a Barrier for 1.5 Seconds"
    ],
    "filters": ["Evade"],
    "effect": "Your Evade is now Soar.\nSoar deals [10-50%] increased damage.",
    "flavor": "\"Sky Spirits weave the winds. Thunder is their laughter and auroras their crowns. Those they bless learn to scorn the earth, for from above, it is but a distant memory.\" - Lintel VII"
  },
  {
    "name": "Soulbrand",
    "type": "Chest Armor",
    "terciary_stats": ["Maximum Life", "Damage Reduction while Healthy", "Barrier Generation", "Potion Capacity"],
    "filters": ["Damage Reduction", "Barrier"],
    "effect": "Your Healing Potion no longer Heals instantly, instead it grants a Barrier for 200% of the healing for 4 seconds. You gain [10-30%] Damage Reduction while you have a Barrier and may drink your Healing Potion while at full Life.",
    "flavor": "\"To create such an artifact would require an impossible mastery over alchemy, transmutation and the subtle magics of the soul. By all rights, it should not exist, yet it does.\""
  },
  {
    "name": "Staff of Endless Rage",
    "class": "Sorcerer",
    "type": "Staff",
    "secondary_stats": ["Fire Damage"],
    "terciary_stats": [
      "Chance for Fireball Projectiles to Cast Twice",
      "Fireball Projectile Speed",
      "Ranks to Fireball\nIntelligence"
    ],
    "effect": "Every 3rd cast of Fireball launches 2 additional projectiles dealing [50-90%] increased damage.",
    "flavor": "\"Leaving even blackened bones for your kin to mourn is too good an end for you.\" - Josiah"
  },
  {
    "name": "Staff of Lam Esen",
    "class": "Sorcerer",
    "type": "Staff",
    "secondary_stats": ["Lightning Damage"],
    "terciary_stats": [
      "Chance for Charged Bolts Projectiles to Cast Twice",
      "Intelligence",
      "Ranks to Charged Bolts",
      "Resource Cost Reduction"
    ],
    "effect": "Your cast of Charged Bolts have a [40-80%] chance to be attracted to enemies and last 300% longer.",
    "flavor": "\"Also known as the Greatstaff of the Old Religion, this powerful relic is one of only a small handful of Skatsimi artifacts that have survived to this day.\" - Barrett's Book of Implements"
  },
  {
    "name": "Starfall Coronet",
    "class": "Sorcerer",
    "type": "Helm",
    "terciary_stats": ["Ranks to Meteor", "Cooldown Reduction", "Meteor Size", "Intelligence"],
    "effect": "Meteor's Mana cost is replaced with a [10-4] second Cooldown and 2 total Charges. Casting Meteor drops 3 additional Meteors around the target. Its Enchantment and Enhancement drop 1 additional Meteor instead.",
    "flavor": "\"The elders say they saw a star falling from the sky many years ago. A sign from the heavens that the end times were nigh. A rallying cry to take up arms and protect Sanctuary!\" - Crusader Hamilton"
  },
  {
    "name": "Stone of Vehemen",
    "class": "Druid",
    "type": "Totem",
    "secondary_stats": ["Damage to Crowd Controlled Enemies"],
    "terciary_stats": [
      "Chance for Stone Burst to Cast Twice",
      "Ranks to Stone Burst",
      "Critical Strike Damage",
      "Willpower"
    ],
    "filters": ["Damage Reduction"],
    "effect": "While Channeling Stone Burst and for 2 seconds afterwards, you gain 15% Damage Reduction.\n\nStone Burst's final explosion deals x [10-15%] increased damage, further increased by x [10-15%] for each size increase.",
    "flavor": "Long ago, the Stone Clan laid the foundations of Old Kurast. They shaped earthen marvels, but wars with the Vizjerei turned chisel into spear. Now the only stone they wield is when cast against foe."
  },
  {
    "name": "Storm's Companion",
    "class": "Druid",
    "type": "Pants",
    "secondary_stats": ["Your Potion Also Briefly Grants Movement Speed"],
    "terciary_stats": [
      "Damage Reduction from Close Enemies",
      "[X]% to the Pack Leader Spirit Boon's Lucky Hit Chance",
      "Wolves Attack Speed",
      "Ranks to Wolves"
    ],
    "filters": ["Lightning"],
    "effect": "Your Wolf Companions are infused with the power of the storm, dealing Lightning damage and gaining the Storm Howl ability.",
    "flavor": "\"The storm's rage is my own, brother. I call, and the skies roar in reply.\" - Vasily, to Bul-Kathos"
  },
  {
    "name": "Tal Rasha's Iridescent Loop",
    "class": "Sorcerer",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Resistance to All Elements"],
    "terciary_stats": ["Non-Physical Damage", "Cooldown Reduction", "Lucky Hit Chance", "Ranks to Potent Warding"],
    "filters": ["Pyromancy", "Shock", "Frost"],
    "effect": "Casting a Pyromancy, Shock, or Frost Skill increases your damage by [10-25%] for 8 seconds, stacking once per element. Casting again refreshes all bonuses if the previous skill was a different Element.",
    "flavor": "\"Fool said he dug it out of the sands near Lut Gholein with a few other 'worthless trinkets'. I hid my delight at receiving such a treasure in exchange for a meager handful of coins.\" Rakhaan"
  },
  {
    "name": "Tassets of the Dawning Sky",
    "type": "Pants",
    "secondary_stats": ["While Injured, Your Potion Also Grants 30% Movement Speed for 2 Seconds"],
    "terciary_stats": [
      "Resistance to All Elements",
      "Maximum Resistance to All Elements",
      "Movement Speed",
      "All Stats"
    ],
    "filters": ["Resistance"],
    "effect": "When you take damage from a Non-Physical damage type, you gain [8-15%] Maximum Resistance to that damage type for 6 seconds. Can only apply to one damage type at a time.",
    "flavor": "“May the Light of Father Inarius shine down upon all weary travelers of this holy land. Turn your face toward his radiance and find your strength renewed.” - Statue Inscription"
  },
  {
    "name": "Temerity",
    "type": "Pants",
    "secondary_stats": ["Your Potion Also Briefly Grants Movement Speed"],
    "terciary_stats": [
      "Lucky Hit: Up to a 5% Chance to Heal [X] Life",
      "Healing Received",
      "Damage Reduction while Healthy",
      "Maximum Life"
    ],
    "filters": ["Heal", "Barrier"],
    "effect": "Effects that Heal you beyond 100% Life grant you a Barrier up to [40-100%] of your Maximum Life that lasts for 8 seconds. You may now drink your Healing Potion while at full Life.",
    "flavor": "\"The revelation that master tailor Callas was in fact a witch only served to further fuel the desire for her uniquely enchanted legwraps.\" - Barrett's Book of Implements"
  },
  {
    "name": "Tempest Roar",
    "class": "Druid",
    "type": "Helm",
    "terciary_stats": ["Maximum Resource", "Willpower", "Ranks to Wild Impulses", "Lightning Resistance"],
    "filters": ["Lucky Hit", "Storm", "Werewolf"],
    "effect": "Lucky Hit: Storm Skills have up to a [15-35%] chance to grant 4 Spirit. Your base Storm Skills are now also Werewolf Skills.",
    "flavor": "\"Listen, child, to the music of the storm. It has its own rhythm. Its own melody. Hear how beautifully it sings, and perhaps one day you will be able to join in its harmony.\" - Airidah"
  },
  {
    "name": "The Basilisk",
    "class": "Druid",
    "type": "Staff",
    "secondary_stats": ["Damage to Crowd Controlled Enemies"],
    "terciary_stats": [
      "Earth Attack Speed",
      "Critical Strike Damage",
      "Physical Damage",
      "Critical Strike Chance Against Stunned Enemies"
    ],
    "effect": "When you first hit an enemy with an Earth Skill, Petrify them for 3 seconds. Petrifying an enemy additionally deals [X] Physical damage.",
    "flavor": "\"Well did she feed her children, and well did her children feed her.\" -Scosglen folktale"
  },
  {
    "name": "The Butcher's Cleaver",
    "type": "1h Axe",
    "secondary_stats": ["Damage to Injured Enemies"],
    "terciary_stats": [
      "Critical Strike Chance Against Feared Enemies",
      "Movement Speed",
      "Attack Speed",
      "Physical Damage"
    ],
    "filters": ["Slow", "Critical Strike", "Slow"],
    "effect": "Lucky Hit: Critically Striking an enemy has up to a 100% chance to Fear and Slow them by [61-90%] for 4 seconds.",
    "flavor": "A nightmarish amalgam of blood, bone and steel, this axe is as horrific, and as deadly, as its creator."
  },
  {
    "name": "The Grandfather",
    "mythic": true,
    "type": "2h Sword",
    "secondary_stats": ["150% Damage", "Ignore Durability Loss"],
    "terciary_stats": ["150 All Stats", "300% Damage", "662 Maximum Life", "20 Maximum Resource"],
    "filters": ["Critical Strike Damage"],
    "effect": "Increases your Critical Strike Damage by 100%. The other properties of this weapon can roll higher than normal.",
    "flavor": "An unbroken lineage of unwavering strength."
  },
  {
    "name": "The Mortacrux",
    "class": "Necromancer",
    "type": "1h Dagger",
    "secondary_stats": ["Macabre and Corpse Damage"],
    "terciary_stats": [
      "Intelligence",
      "Chance For Corpse Explosion to Deal Double Damage",
      "Hewed Flesh also grants a Barrier for [X]% Maximum Life for 4 seconds",
      "Ranks to Hewed Flesh"
    ],
    "effect": "When consuming a Corpse, there is a [10-30%] chance to also create a decaying Skeletal Simulacrum that seeks enemies but cannot attack. When it dies, it explodes for [X] Shadow damage. This effect is treated as a Macabre Skill.",
    "flavor": "One of a pair of twin daggers, forbidden from ever meeting. Nearby corpses shudder in its presence."
  },
  {
    "name": "The Oculus",
    "class": "Sorcerer",
    "type": "Wand",
    "secondary_stats": ["Maximum Evade Charges", "Attacks Reduce Evade's Cooldown by 1.5 Seconds"],
    "terciary_stats": [
      "Teleport Damage",
      "[X%] Chance for Teleport to Deal Double Damage",
      "Intelligence",
      "Ranks to Teleport"
    ],
    "effect": "Gain the effect of the Teleport Enchantment for free. When you Evade using Teleport Enchantment, you are taken to a random location.",
    "flavor": "\"The rhythm of the orb, which had pulsed steadily for five centuries, quickened as its owner took his final ragged breaths. It were as if some intelligence within reveled in the sight.\" - Master Eos"
  },
  {
    "name": "The Third Blade",
    "class": "Barbarian",
    "type": "1h Sword",
    "secondary_stats": ["Damage to Close Enemies"],
    "terciary_stats": ["Vulnerable Damage", "Strength", "Weapon Mastery Damage", "Fury on Kill"],
    "filters": ["Core Skill"],
    "effect": "Your Weapon Mastery Skills are now also Core Skills that have no Cooldowns but cost Fury, dealing [50-70%] of normal damage. Their Fury costs are reduced by 5 for any additional Charges the Skill would have had.",
    "flavor": "\"Restraint, mercy, honor...these are shackles, forged by the weak and the conquered.\" -Hephasto, the Armorer"
  },
  {
    "name": "The Umbracrux",
    "class": "Rogue",
    "type": "1h Dagger",
    "secondary_stats": ["Damage"],
    "terciary_stats": ["Dexterity", "Vulnerable Damage", "Subterfuge Cooldown Reduction", "Ranks to Innervation"],
    "effect": "Your Subterfuge Skills create an attackable Shade Totem for [3-8] seconds. Any damage it takes is replicated onto surrounding enemies at 20% effectiveness. You may only have 1 Shade Totem active at a time. This damage counts as a Trap Skill.",
    "flavor": "One of a pair of twin daggers, forbidden from ever meeting. Bitter voices whisper from the blade."
  },
  {
    "name": "The Unmaker",
    "class": "Necromancer",
    "type": "Helm",
    "terciary_stats": [
      "Chance for Soulrift to Deal Double Damage",
      "Resource Generation",
      "Ranks to Imperfectly Balanced",
      "Damage Reduction while you Have a Barrier"
    ],
    "filters": ["Essence", "Shadow"],
    "effect": "Soulrift's duration is increased by 0.5 seconds for every 30 Essence you spend while it is active, up to 8 seconds. Soulrift deals [100-200%] of its Shadow damage per second to surrounding enemies for every 30 Essence you gain while it is active."
  },
  {
    "name": "Tibault's Will",
    "type": "Pants",
    "terciary_stats": ["All Stats", "Maximum Life", "Maximum Resource", "Damage Reduction while Unstoppable"],
    "filters": ["Unstoppable"],
    "effect": "You deal [10-20%] increased damage while Unstoppable and for 5 seconds after. When you become Unstoppable, gain 50 of your Primary Resource.",
    "flavor": "\"The younger apprentices think wearing heavy plate in the swamps is foolish. They fail to understand that our armor is our legacy, and without it we are nothing.\" - Crusader Pembroke"
  },
  {
    "name": "Tuskhelm of Joritz the Mighty",
    "class": "Barbarian",
    "type": "Helm",
    "terciary_stats": [
      "Damage while Berserking",
      "Attack Speed while Berserking",
      "Movement Speed while Berserking",
      "Maximum Life"
    ],
    "filters": ["Cooldown"],
    "effect": "When you gain Berserking while already Berserk, you have a [40-60%] chance to become more enraged granting x15% increased damage, 2 Fury per second, and 10% Cooldown Reduction.",
    "flavor": "As he fought with side by side with Raekor to liberate the labor camp, Joritz claimed this dented helm from a fallen foe. As his legend grew, its unique shape became synonymous with his great deeds."
  },
  {
    "name": "Twin Strikes",
    "class": "Barbarian",
    "type": "Gloves",
    "terciary_stats": ["Attack Speed", "Critical Strike Chance", "Strength", "Ranks to Double Swing"],
    "effect": "After casting Double Swing 4 times, your next Double Swing will hit 2 additional times, each dealing [30-60%] increased damage.",
    "flavor": "\"When hitting it once doesn't kill it, hit it twice.\" - Bear Tribe Proverb"
  },
  {
    "name": "Tyrael's Might",
    "mythic": true,
    "type": "Chest Armor",
    "secondary_stats": ["Ignore Durability Loss"],
    "terciary_stats": [
      "20% Damage Reduction",
      "16.5% Movement Speed",
      "60% Resistance to All Elements",
      "7.5% Maximum Resistance to All Elements"
    ],
    "filters": ["Damage Reduction", "Resistance"],
    "effect": "While at full Life, your Skills unleash a divine barrage dealing [X] damage.",
    "flavor": "\"Thus Tyrael, a perfect aspect of Justice, came to be. None were more vehement against the forces of hell. All demonic entities learned to shudder at Justice's might.\" - The Books of Jarl, Volume I"
  },
  {
    "name": "Ugly Bastard Helm",
    "class": "Barbarian",
    "type": "Helm",
    "secondary_stats": ["Fire Resistance"],
    "terciary_stats": [
      "Ranks to Prolific Fury",
      "Wrath of the Berserker Cooldown Reduction",
      "Ranks to Agressive Resistance",
      "Lucky Hit: Up to a 40% Chance to Deal [X] Fire Damage"
    ],
    "filters": ["Berserking"],
    "effect": "Explode when activating Wrath of the Berserker, dealing [X] Fire damage to enemies. While Berserking, damage you would deal is converted to Fire damage and deal x [60-80%] increased Fire damage.",
    "flavor": "\"Ah, Burning Hells. You look like one of Zolmog's inbred bastards.\" - Varyana"
  },
  {
    "name": "Unbroken Chain",
    "class": "Barbarian",
    "type": "Amulet",
    "secondary_stats": ["Resistance to All Elements"],
    "terciary_stats": ["Movement Speed", "Ranks to Pit Fighter", "Ultimate Damage", "Steel Grasp Cooldown Reduction"],
    "effect": "Casting Steel Grasp reduces Iron Maelstrom’s Cooldown by [3.3-10] seconds. Enemies damaged by Iron Maelstrom deal [10-30%] less damage for 6 seconds.",
    "flavor": "After the warmaster Raekor freed her people, the Oxen tribe continued to wear their collars and chains to honor those who died in thralldom under the Samauren Empire."
  },
  {
    "name": "Unsung Ascetic's Wraps",
    "class": "Druid",
    "type": "Gloves",
    "terciary_stats": [
      "Ranks to Lightning Storm",
      "Damage to Distant Enemies",
      "Critical Strike Chance",
      "Ranks to Defiance"
    ],
    "effect": "Lightning Storm gains 1 additional strike each times it grows.\nLightning Storm Critical Strikes cause lightning to strike twice, dealing [10-40%] increased damage.",
    "flavor": "\"The storm caller returns, day after day, demanding to meet the Tree. He beats his chest and demonstrates his powers, refusing to believe that he will never be chosen.\" - Excerpt from Gulyas' Diary"
  },
  {
    "name": "Vasily's Prayer",
    "class": "Druid",
    "type": "Helm",
    "terciary_stats": ["Maximum Life", "Willpower", "Ranks to Defensive Posture", "Armor"],
    "filters": ["Fortify", "Earth"],
    "effect": "Your Earth Skills are now also Werebear Skills and Fortify you for [2-5%] of your Maximum Health.",
    "flavor": "\"Roots from the Great Oak growing at the seaward statue of Vasily will, on rare occasions, be found twisted back upon themselves, suffused with ferocious magic.\" - Barrett's Book of Implements"
  },
  {
    "name": "Vox Omnium",
    "class": "Sorcerer",
    "type": "Staff",
    "secondary_stats": ["Lucky Hit Chance"],
    "terciary_stats": ["Non-Physical Damage", "Ranks to Basic Skills", "Core Attack Speed", "Intelligence"],
    "effect": "Casting a Core Skill additionally fires 2 instances of Fire Bolt, Frost Bolt, or Spark, matching the elements of your last 2 non-Core Skill casts. These projectiles deal x [30-90%] increased damage.",
    "flavor": "Your incantations are echoed by a chorus of the damned. Wield their torment, their vengeance, their pain against the Hellborne that tortured them."
  },
  {
    "name": "Waxing Gibbous",
    "class": "Druid",
    "type": "1h Axe",
    "secondary_stats": ["Critical Strike Damage"],
    "terciary_stats": [
      "Critical Strike Damage",
      "Blood Howl Grants Stealth for [X] Seconds",
      "Ranks to Shred",
      "Ranks to Toxic Claws"
    ],
    "filters": ["Stealth", "Critical Strike"],
    "effect": "Killing an enemy with Shred grants Stealth for 2 seconds. Breaking Stealth with an attack grants guaranteed Critical Strikes for [1-4] seconds.",
    "flavor": "The nights preceding the full moon are sometimes far more dangerous than the event itself. The frenzy has begun to rise, yet the night is just dark enough to obscure a hunter from their prey's sight."
  },
  {
    "name": "Wildheart Hunger",
    "class": "Druid",
    "type": "Boots",
    "secondary_stats": ["Attacks Reduce Evade's Cooldown by 1.5 Seconds"],
    "terciary_stats": ["Movement Speed", "Ranks to Heightened Senses", "Shapeshifting Attack Speed", "Cold Resistance"],
    "filters": ["Shapeshift", "Werewolf", "Werebear"],
    "effect": "Shapeshifting into a new animal form increases the value of your Bestial Rampage bonuses by + [2-5%] , up to + [20-50%] . This bonus decays by 2% per second.",
    "flavor": "Do not seek comfort in the shapes of the moon, beastwalker. Its pallid light awakens a yawning hunger. Call the beast, but do not tarry. Lest you never return to your own skin."
  },
  {
    "name": "Windforce",
    "class": "Rogue",
    "type": "Bow",
    "secondary_stats": ["Damage to Crowd Controlled Enemies"],
    "terciary_stats": [
      "Chance for Barrage Projectiles to Cast Twice",
      "Ranks to Barrage",
      "Ranks to Malice",
      "Movement Speed"
    ],
    "filters": ["Knock Down"],
    "effect": "Hits of Barrage have a [30-50%] chance to deal double damage and Knock Down enemies.",
    "flavor": "\"There have been numerous world-shaping conflicts throughout history. This bow has been found on the battlefield of every one, and always in the hands of the victors.\" - Barrett's Book of Implements"
  },
  {
    "name": "Word of Hakan",
    "class": "Rogue",
    "type": "Amulet",
    "secondary_stats": ["Resistance to All Elements"],
    "terciary_stats": [
      "Rain of Arrows Cooldown Reduction",
      "Ultimate Skill Damage",
      "Chance for Rain of Arrows to Deal Double Damage",
      "Ranks to Imbuement Skills"
    ],
    "effect": "Your Rain of Arrows is always Imbued with all Imbuements at once and receives your Arrow Storm benefits.",
    "flavor": "\"Let the great gates of Caldeum be sealed. Let its proud walls stand fiercely defended. The rest of Kehjistan may suffer this plague, but my city, and my people, will not.\" - Proclamation of Hakan II"
  },
  {
    "name": "Writhing Band of Trickery",
    "class": "Rogue",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Shadow Resistance"],
    "terciary_stats": [
      "Dexterity",
      "Subterfuge Cooldown Reduction",
      "Trap Damage",
      "Damage to Crowd Controlled Enemies"
    ],
    "effect": "Casting a Subterfuge Skill leaves behind a Decoy Trap that continuously Taunts and lures enemies. After 2 seconds, it explodes, dealing [X] Shadow damage. This effect is treated as a Trap Skill and can only spawn one Decoy Trap every 6 seconds.",
    "flavor": "The ring shifts and spins on your finger as the forces within desperately attempt to escape."
  },
  {
    "name": "Wushe Nak Pa",
    "class": "Spiritborn",
    "type": "Glaive",
    "secondary_stats": ["Attacks Reduce Ultimate Cooldown by 0.4 Seconds"],
    "terciary_stats": [
      "Ultimate Damage",
      "Dexterity",
      "Casting Ultimate Skills Restores [X] Primary Resource",
      "Ranks to Supremacy"
    ],
    "filters": ["Ultimate"],
    "effect": "Casting an Ultimate Skill grants or amplifies its matching Primary Spirit Hall Bonus with [50-100%] potency for 15 seconds.\n\nYour Ultimate Skills each gain an additional Skill Type:\n The Seeker is a Focus Skill.\n The Hunter is a Mobility Skill.\n The Devourer is a Potency Skill.\n The Protector is a Defensive Skill.",
    "flavor": "\"Fear not the limits of your flesh, Spiritborn!  As our ancestors said: wūshe nak pa! Transcend your being!\" - Maka"
  },
  {
    "name": "X'Fal's Corroded Signet",
    "type": "Ring",
    "secondary_stats": ["Resistance to All Elements", "Fire Resistance"],
    "terciary_stats": ["All Stats", "Damage Over Time", "Vulnerable Damage", "Lucky Hit Chance"],
    "filters": ["Lucky Hit"],
    "effect": "Lucky Hit: Your damage over time effects have up to a 75% chance to erupt, dealing [X] damage of the same type to surrounding enemies.",
    "flavor": "Skulking in the shadows of the Realm of Destruction, the Scarred Baron plots the downfall of the mortal who banished him here."
  },
  {
    "name": "Yen's Blessing",
    "type": "Boots",
    "secondary_stats": ["Maximum Evade Charges"],
    "terciary_stats": ["Movement Speed", "All Stats", "Resource Generation", "Resistance to All Elements"],
    "effect": "Casting a Skill has a [40-60%] chance to cast a Non-Mobility, Non-Ultimate Skill that is currently on Cooldown. Can only occur once every 8 seconds.",
    "flavor": "These greaves are imbued with the divine blessing of Yen, the Veradani goddess of restoration. They bestow the wearer a revitalizing strength that enhances their own."
  }
]
